src/cf/InformationRegisters/РабочиеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РабочиеГруппы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автоподстановка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контроль</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияОзнакомления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияСогласования</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияРегистрации</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияПодписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТемыОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаписиРабочегоКалендаря</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтактовПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтейнерыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ОбработкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОбработкиОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ДокументыПредприятия</xr:Item>
				<xr:Item>Catalog.Мероприятия</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоместилВИсторию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещенаВИсторию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прервал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПрерывания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.КомплексныйПроцесс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбработкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/КэшиНаВремяВызова/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Кэши на время взова, для оптимизации работы (сервер).
//
////////////////////////////////////////////////////////////////////////////////

// @strict-types


#Область ПрограммныйИнтерфейс

// Заполняет кеш областми просмотра.
//
// Параметры:
//  ЗадачаИлиДействиеЗадачи - ДокументСсылка.Задача, ДокументСсылка.ДействиеЗадачи - Задача или действие.
//
// Возвращаемое значение:
//  Структура - Кеш области просмотра:
//   *  Заполнен - Булево.
//   *  Задача - ДокументСсылка.Задача.
//   *  ЗадачаОбъект - ДокументОбъект.Задача, Неопределено - Задача.
//   *  ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи.
//   *  РеквизитыДействияЗадачи - Структура, Неопределено - Реквизиты действия задачи.
//
Функция ИнициализироватьКэшЗадачаОбластьПросмотра(ЗадачаИлиДействиеЗадачи) Экспорт
	
	КэшОбластиПросмотра = КэшиНаВремяВызоваПовтИсп.КэшЗадачаОбластьПросмотра();
	
	Если КэшОбластиПросмотра.Заполнен Или Не ЗначениеЗаполнено(ЗадачаИлиДействиеЗадачи) Тогда
		Возврат КэшОбластиПросмотра;
	КонецЕсли;
	
	КэшОбластиПросмотра.Заполнен = Истина;
	
	Если ТипЗнч(ЗадачаИлиДействиеЗадачи) = Тип("ДокументСсылка.ДействиеЗадачи") Тогда
		
		РеквизитыДействияЗадачи =
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ЗадачаИлиДействиеЗадачи,
				"Ссылка, Задача, Исполнитель, Источник,
				|ВидДействия, ВидУчастника, ЕстьОсобыйСрок,
				|ОсобыйЗаголовок, ОсобоеОписание, ОсобоеОписаниеФорматированное,
				|ОсобыйСрок, РезультатДействия, РезультатДействияТекстом, ФактическийИсполнитель,
				|СостояниеУчастникаЗадачи, Флаг, ПометкаУдаления, Приложения, ВерсияДанных");
		
		КэшОбластиПросмотра.ДействиеЗадачи = ЗадачаИлиДействиеЗадачи;
		КэшОбластиПросмотра.РеквизитыДействияЗадачи = РеквизитыДействияЗадачи;
		КэшОбластиПросмотра.Задача = РеквизитыДействияЗадачи.Задача;
		
	ИначеЕсли ТипЗнч(ЗадачаИлиДействиеЗадачи) = Тип("ДокументСсылка.Задача") Тогда
		
		КэшОбластиПросмотра.Задача = ЗадачаИлиДействиеЗадачи;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неожиданный тип задачи или действия задачи %1 (%2).'"),
			ЗадачаИлиДействиеЗадачи,
			ТипЗнч(ЗадачаИлиДействиеЗадачи));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КэшОбластиПросмотра.Задача) Тогда
		КэшОбластиПросмотра.ЗадачаОбъект = КэшОбластиПросмотра.Задача.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат КэшОбластиПросмотра;
	
КонецФункции

// Инициализирует кэш для формы элементы справочника документы предприятия.
//
// Параметры:
//  ДокументОбъект - СправочникОбъект.ДокументыПредприятия.
// 
// Возвращаемое значение:
//  Структура - Кэш для формы элементы справочника документы предприятия:
//   * Инициализирован - Булево - Кэш инициализирован.
//   * КэшДокумента - Структура - Кэш документа:
//     ** Ссылка - СправочникСсылка.ДокументыПредприятия.
//     ** ВидДокумента - СправочникСсылка.ВидыДокументов.
//     ** Шаблон - СправочникСсылка.ШаблоныДокументов.
//     ** ЕстьФайлыШаблона - Булево.
//     ** Контрагент - СправочникСсылка.Контрагенты.
//     ** ПодписалОтКонтрагента - СправочникСсылка.КонтактныеЛица.
//     ** ДатаСоздания - Дата.
//     ** ДатаРегистрации - Дата.
//     ** Стороны - ТабличнаяЧасть.
//   * КэшВидаДокумента - Структура - Кэш вида документа. См. Делопроизводство.КэшВидаДокумента.
//   * УчастникиРабочейГруппы - См. РегистрыСведений.РабочиеГруппы.ПолучитьУчастниковПоОбъекту.
//   * ВсеСостоянияДокумента - См. Делопроизводство.ПолучитьВсеСостоянияДокумента.
//   * КэшОбработки - Структура - Кэш обработки:
//     ** Ссылка - СправочникСсылка.ОбработкиОбъектов.
//     ** ДатаСоздания - Дата.
//     ** Состояние - ПеречислениеСсылка.СостоянияОбработкиОбъектов.
//     ** ДатаИзмененияСостояния - Дата.
//     ** ДатаНачала - Дата.
//
Функция ИнициализироватьДокументыПредприятияФормаЭлемента(ДокументОбъект) Экспорт
	
	КэшДокументыПредприятияФормаЭлемента =
		КэшиНаВремяВызоваПовтИсп.КэшДокументыПредприятияФормаЭлемента();
	
	КэшДокументыПредприятияФормаЭлемента.КэшДокумента.Ссылка = ДокументОбъект.Ссылка;
	КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ВидДокумента = ДокументОбъект.ВидДокумента;
	КэшДокументыПредприятияФормаЭлемента.КэшДокумента.Шаблон = ДокументОбъект.Шаблон;
	КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ЕстьФайлыШаблона =
		РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(ДокументОбъект.Шаблон, Ложь).Количество() > 0;
	КэшДокументыПредприятияФормаЭлемента.КэшДокумента.Контрагент = ДокументОбъект.Контрагент;
	КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ПодписалОтКонтрагента =
		ДокументОбъект.ПодписалОтКонтрагента;
	КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ДатаСоздания = ДокументОбъект.ДатаСоздания;
	КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ДатаРегистрации =
		ДокументОбъект.ДатаРегистрации;
	КэшДокументыПредприятияФормаЭлемента.КэшДокумента.Стороны = ДокументОбъект.Стороны;
	
	КэшДокументыПредприятияФормаЭлемента.КэшВидаДокумента =
		Делопроизводство.КэшВидаДокумента(ДокументОбъект.ВидДокумента);
	
	КэшДокументыПредприятияФормаЭлемента.УчастникиРабочейГруппы =
		РегистрыСведений.РабочиеГруппы.ПолучитьУчастниковПоОбъекту(ДокументОбъект.Ссылка);
	
	КэшДокументыПредприятияФормаЭлемента.ВсеСостоянияДокумента =
		Делопроизводство.ПолучитьВсеСостоянияДокумента(ДокументОбъект.Ссылка);
	
	ОбработкаОбъекта = Справочники.ОбработкиОбъектов.ОбработкаОбъекта(ДокументОбъект.Ссылка);
	КэшДокументыПредприятияФормаЭлемента.КэшОбработки.Ссылка = ОбработкаОбъекта;
	Если ЗначениеЗаполнено(ОбработкаОбъекта) Тогда
		РеквизитыОбработки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ОбработкаОбъекта,
			"ДатаСоздания, Состояние, ДатаИзмененияСостояния, ДатаНачала");
		КэшДокументыПредприятияФормаЭлемента.КэшОбработки.ДатаСоздания =
			РеквизитыОбработки.ДатаСоздания;
		КэшДокументыПредприятияФормаЭлемента.КэшОбработки.Состояние =
			РеквизитыОбработки.Состояние;
		КэшДокументыПредприятияФормаЭлемента.КэшОбработки.ДатаИзмененияСостояния =
			РеквизитыОбработки.ДатаИзмененияСостояния;
		КэшДокументыПредприятияФормаЭлемента.КэшОбработки.ДатаНачала =
			РеквизитыОбработки.ДатаНачала;
	КонецЕсли;
	
	// Кэш отмечаем инициализированным в самом конце, чтобы не ограничивать используемые в расчётах методы.
	КэшДокументыПредприятияФормаЭлемента.Инициализирован = Истина;
	
	Возврат КэшДокументыПредприятияФормаЭлемента;
	
КонецФункции

// Переносит кэш для формы элементы справочника документы предприятия.
//
// Параметры:
//  ПереносКэшаИзЧтенияВСоздание - Структура - Переносимый кэш:
//   * Инициализирован - Булево - Кэш инициализирован.
//   * КэшДокумента - Структура - Кэш документа:
//     ** Ссылка - СправочникСсылка.ДокументыПредприятия.
//     ** ВидДокумента - СправочникСсылка.ВидыДокументов.
//     ** Шаблон - СправочникСсылка.ШаблоныДокументов.
//     ** ЕстьФайлыШаблона - Булево.
//     ** Контрагент - СправочникСсылка.Контрагенты.
//     ** ПодписалОтКонтрагента - СправочникСсылка.КонтактныеЛица.
//     ** ДатаСоздания - Дата.
//     ** ДатаРегистрации - Дата.
//     ** Стороны - ТабличнаяЧасть.
//   * КэшВидаДокумента - Структура - Кэш вида документа. См. Делопроизводство.КэшВидаДокумента.
//   * УчастникиРабочейГруппы - См. РегистрыСведений.РабочиеГруппы.ПолучитьУчастниковПоОбъекту.
//   * ВсеСостоянияДокумента - См. Делопроизводство.ПолучитьВсеСостоянияДокумента.
//   * КэшОбработки - Структура - Кэш обработки:
//     ** Ссылка - СправочникСсылка.ОбработкиОбъектов.
//     ** ДатаСоздания - Дата.
//     ** Состояние - ПеречислениеСсылка.СостоянияОбработкиОбъектов.
//     ** ДатаИзмененияСостояния - Дата.
//     ** ДатаНачала - Дата.
//
Процедура ПеренестиДокументыПредприятияФормаЭлемента(ПереносКэшаИзЧтенияВСоздание) Экспорт
	
	Если ПереносКэшаИзЧтенияВСоздание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КэшДокументыПредприятияФормаЭлемента =
		КэшиНаВремяВызоваПовтИсп.КэшДокументыПредприятияФормаЭлемента();
	
	КэшДокументыПредприятияФормаЭлемента.Инициализирован = Истина;
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшДокумента",
		ПереносКэшаИзЧтенияВСоздание.КэшДокумента);
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшВидаДокумента",
		ПереносКэшаИзЧтенияВСоздание.КэшВидаДокумента);
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("УчастникиРабочейГруппы",
		ПереносКэшаИзЧтенияВСоздание.УчастникиРабочейГруппы);
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("ВсеСостоянияДокумента",
		ПереносКэшаИзЧтенияВСоздание.ВсеСостоянияДокумента);
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшОбработки",
		ПереносКэшаИзЧтенияВСоздание.КэшОбработки);
	
КонецПроцедуры

#КонецОбласти
